{
    "actor.actor_id": "Table: actor - Description: stores actor data including first name and last name. - Column: actor_id - Detail: a unique id that corresponds to a specific actor",
    "actor.first_name": "Table: actor - Description: stores actor data including first name and last name. - Column: first_name - Detail: first name of an actor",
    "actor.last_name": "Table: actor - Description: stores actor data including first name and last name. - Column: last_name - Detail: last name of an actor",
    "actor.last_update": "Table: actor - Description: stores actor data including first name and last name. - Column: last_update - Detail: last time that line in the table was updated",
    "film.film_id": "Table: film - Description: stores film data such as title, release year, length, rating, etc. - Column: film_id - Detail: a unique id that corresponds to a specific film",
    "film.title": "Table: film - Description: stores film data such as title, release year, length, rating, etc. - Column: title - Detail: the title of the film",
    "film.description": "Table: film - Description: stores film data such as title, release year, length, rating, etc. - Column: description - Detail: a brief description of the film",
    "film.release_year": "Table: film - Description: stores film data such as title, release year, length, rating, etc. - Column: release_year - Detail: the year the film was released",
    "film.language_id": "Table: film - Description: stores film data such as title, release year, length, rating, etc. - Column: language_id - Detail: an id numer that corresponds to a language",
    "film.rental_duration": "Table: film - Description: stores film data such as title, release year, length, rating, etc. - Column: rental_duration - Detail: the amout of time a film can be rented out",
    "film.rental_rate": "Table: film - Description: stores film data such as title, release year, length, rating, etc. - Column: rental_rate - Detail: the rate at which the film can be rented per unit of time.",
    "film.length": "Table: film - Description: stores film data such as title, release year, length, rating, etc. - Column: length - Detail: the length or duration of the film in minutes",
    "film.replacement_cost": "Table: film - Description: stores film data such as title, release year, length, rating, etc. - Column: replacement_cost - Detail: the amount of money it takes to replace the film if lost or damaged.",
    "film.rating": "Table: film - Description: stores film data such as title, release year, length, rating, etc. - Column: rating - Detail: the rating according to the motion picture association. This corresponds to what age group is suitable to watch this film.",
    "film.last_update": "Table: film - Description: stores film data such as title, release year, length, rating, etc. - Column: last_update - Detail: last time that line in the table was updated",
    "film.special features": "Table: film - Description: stores film data such as title, release year, length, rating, etc. - Column: special features - Detail: extra feautres the film may have such as \"Deleted Scenes\" or \"Trailers\"",
    "film.fulltext": "Table: film - Description: stores film data such as title, release year, length, rating, etc. - Column: fulltext - Detail: a list of words that describe the film and numbers that show how often they appear in the description",
    "film_actor.film_id": "Table: film_actor - Description: stores the relationships between films and actors. - Column: film_id - Detail: a unique id that corresponds to a specific film",
    "film_actor.actor_id": "Table: film_actor - Description: stores the relationships between films and actors. - Column: actor_id - Detail: a unique id that corresponds to a specific actor",
    "film_actor.last_update": "Table: film_actor - Description: stores the relationships between films and actors. - Column: last_update - Detail: last time that line in the table was updated",
    "category.category_id": "Table: category - Description: stores film's categories data. - Column: category_id - Detail: a unique id that corresponds to a specific film category",
    "category.name": "Table: category - Description: stores film's categories data. - Column: name - Detail: the name of the category such as Action or Documentary",
    "category.last_update": "Table: category - Description: stores film's categories data. - Column: last_update - Detail: last time that line in the table was updated",
    "film_category.film_id": "Table: film_category - Description: stores the relationships between films and categories. - Column: film_id - Detail: a unique id that corresponds to a specific film",
    "film_category.category_id": "Table: film_category - Description: stores the relationships between films and categories. - Column: category_id - Detail: a unique id that corresponds to a specific film category",
    "film_category.last_update": "Table: film_category - Description: stores the relationships between films and categories. - Column: last_update - Detail: last time that line in the table was updated",
    "store.store_id": "Table: store - Description: contains the store data including manager staff and address. - Column: store_id - Detail: a unique id that corresponds to a specific store",
    "store.manager_staff_id": "Table: store - Description: contains the store data including manager staff and address. - Column: manager_staff_id - Detail: an id that corresponds to a specific manager",
    "store.address_id": "Table: store - Description: contains the store data including manager staff and address. - Column: address_id - Detail: an id that corresponds to a specific address",
    "store.last_update": "Table: store - Description: contains the store data including manager staff and address. - Column: last_update - Detail: last time that line in the table was updated",
    "inventory.inventory_id": "Table: inventory - Description: stores inventory data. - Column: inventory_id - Detail: a unique id that corresponds to a specific inventory",
    "inventory.film_id": "Table: inventory - Description: stores inventory data. - Column: film_id - Detail: a unique id that corresponds to a specific film",
    "inventory.store_id": "Table: inventory - Description: stores inventory data. - Column: store_id - Detail: a unique id that corresponds to a specific store",
    "inventory.last_update": "Table: inventory - Description: stores inventory data. - Column: last_update - Detail: last time that line in the table was updated",
    "rental.rental_id": "Table: rental - Description: stores rental data. - Column: rental_id - Detail: a unique id that corresponds to a specific rental",
    "rental.rental_date": "Table: rental - Description: stores rental data. - Column: rental_date - Detail: the date and time the film was rented out",
    "rental.inventory_id": "Table: rental - Description: stores rental data. - Column: inventory_id - Detail: a unique id that corresponds to a specific inventory",
    "rental.customer_id": "Table: rental - Description: stores rental data. - Column: customer_id - Detail: a unique id that corresponds to a specific customer",
    "rental.return_date": "Table: rental - Description: stores rental data. - Column: return_date - Detail: the date the film was returned to the store",
    "rental.staff_id": "Table: rental - Description: stores rental data. - Column: staff_id - Detail: a unique id that corresponds to a specific staff member",
    "rental.last_update": "Table: rental - Description: stores rental data. - Column: last_update - Detail: last time that line in the table was updated",
    "payment.payment_id": "Table: payment - Description: stores customer's payments. - Column: payment_id - Detail: a unique id that corresponds to a specific payment",
    "payment.customer_id": "Table: payment - Description: stores customer's payments. - Column: customer_id - Detail: a unique id that corresponds to a specific customer",
    "payment.staff_id": "Table: payment - Description: stores customer's payments. - Column: staff_id - Detail: a unique id that corresponds to a specific staff member",
    "payment.rental_id": "Table: payment - Description: stores customer's payments. - Column: rental_id - Detail: a unique id that corresponds to a specific rental",
    "payment.amount": "Table: payment - Description: stores customer's payments. - Column: amount - Detail: amount of money payed for the rental",
    "payment.payment_date": "Table: payment - Description: stores customer's payments. - Column: payment_date - Detail: the date and time the payment was made",
    "staff.staff_id": "Table: staff - Description: stores staff data. - Column: staff_id - Detail: a unique id that corresponds to a specific staff member",
    "staff.first_name": "Table: staff - Description: stores staff data. - Column: first_name - Detail: first name of a staff member",
    "staff.last_name": "Table: staff - Description: stores staff data. - Column: last_name - Detail: last name of a staff member",
    "staff.address_id": "Table: staff - Description: stores staff data. - Column: address_id - Detail: an id that corresponds to a specific address",
    "staff.email": "Table: staff - Description: stores staff data. - Column: email - Detail: the staff member's email",
    "staff.store_id": "Table: staff - Description: stores staff data. - Column: store_id - Detail: a unique id that corresponds to a specific store",
    "staff.active": "Table: staff - Description: stores staff data. - Column: active - Detail: a true or false boolean that shows if they are an active staff member or not",
    "staff.username": "Table: staff - Description: stores staff data. - Column: username - Detail: username of the staff member",
    "staff.password": "Table: staff - Description: stores staff data. - Column: password - Detail: password of the staff member",
    "staff.last_update": "Table: staff - Description: stores staff data. - Column: last_update - Detail: last time that line in the table was updated",
    "staff.picture": "Table: staff - Description: stores staff data. - Column: picture - Detail: optional binary image data that shows the staff members picture",
    "customer.customer_id": "Table: customer - Description: stores customer data. - Column: customer_id - Detail: a unique id that corresponds to a specific customer",
    "customer.store_id": "Table: customer - Description: stores customer data. - Column: store_id - Detail: a unique id that corresponds to a specific store",
    "customer.first_name": "Table: customer - Description: stores customer data. - Column: first_name - Detail: first name of a customer",
    "customer.last_name": "Table: customer - Description: stores customer data. - Column: last_name - Detail: last name of a customer",
    "customer.email": "Table: customer - Description: stores customer data. - Column: email - Detail: the customer's email",
    "customer.address_id": "Table: customer - Description: stores customer data. - Column: address_id - Detail: an id that corresponds to a specific address",
    "customer.activebool": "Table: customer - Description: stores customer data. - Column: activebool - Detail: a true or false boolean that shows if they are an active customer or not",
    "customer.create_date": "Table: customer - Description: stores customer data. - Column: create_date - Detail: the date and time the customers information first entered the database",
    "customer.last_update": "Table: customer - Description: stores customer data. - Column: last_update - Detail: last time that line in the table was updated",
    "customer.active": "Table: customer - Description: stores customer data. - Column: active - Detail: a 1 or 0 number that shows if they are an active staff member or not",
    "address.address_id": "Table: address - Description: stores address data for staff and customers - Column: address_id - Detail: an id that corresponds to a specific address",
    "address.address": "Table: address - Description: stores address data for staff and customers - Column: address - Detail: a street address",
    "address.address2": "Table: address - Description: stores address data for staff and customers - Column: address2 - Detail: optional additional information about the address, such as apartment number",
    "address.district": "Table: address - Description: stores address data for staff and customers - Column: district - Detail: the state or district of the address",
    "address.city_id": "Table: address - Description: stores address data for staff and customers - Column: city_id - Detail: a unique id that corresponds to a city",
    "address.postal_code": "Table: address - Description: stores address data for staff and customers - Column: postal_code - Detail: the postal code of the address",
    "address.phone": "Table: address - Description: stores address data for staff and customers - Column: phone - Detail: the phone number at that address",
    "address.last_update": "Table: address - Description: stores address data for staff and customers - Column: last_update - Detail: last time that line in the table was updated",
    "city.city_id": "Table: city - Description: stores city names. - Column: city_id - Detail: a unique id that corresponds to a city",
    "city.city": "Table: city - Description: stores city names. - Column: city - Detail: the name of the city",
    "city.country_id": "Table: city - Description: stores city names. - Column: country_id - Detail: a unique id that corresponds to a country",
    "city.last_update": "Table: city - Description: stores city names. - Column: last_update - Detail: last time that line in the table was updated",
    "country.country_id": "Table: country - Description: stores country names. - Column: country_id - Detail: a unique id that corresponds to a country",
    "country.country": "Table: country - Description: stores country names. - Column: country - Detail: the name of the country",
    "country.last_update": "Table: country - Description: stores country names. - Column: last_update - Detail: last time that line in the table was updated"
}